cmsis-svd/cmsis-svd/data/STMicro/STM32F30xxx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt
      Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1001</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ICTR</name>
          <displayName>ICTR</displayName>
          <description>Interrupt Controller Type
          Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTLINESNUM</name>
              <description>Total number of interrupt lines in
              groups</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STIR</name>
          <displayName>STIR</displayName>
          <description>Software Triggered Interrupt
          Register</description>
          <addressOffset>0xEFC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTID</name>
              <description>interrupt to be triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISERn</name>
          <displayName>ISERn</displayName>
          <description>Interrupt Set-Enable Registers, ISER0
          (0xE000E100) to ISER15 (0xE000E13C)</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SETENA</name>
              <description>SETENA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICERn</name>
          <displayName>ICERn</displayName>
          <description>Interrupt Clear-Enable Registers, ICER0
          (0xE000E180) to ICER15 (0xE000E1BC)</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>CLRENA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISPRn</name>
          <displayName>ISPRn</displayName>
          <description>Interrupt Set-Pending Registers, ISPR0
          (0xE000E200) to ISPR15 (0xE000E23C)</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>SETPEND</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICPRn</name>
          <displayName>ICPRn</displayName>
          <description>Interrupt Clear-Pending Registers, ICPR0
          (0xE000E280) to ICPR15 (0xE000E2BC)</description>
          <addressOffset>0x27C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>CLRPEND</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IABRn</name>
          <displayName>IABRn</displayName>
          <description>Interrupt Active Bit Registers, IABR0
          (0xE000E300) to IABR15 (0xE000E37C)</description>
          <addressOffset>0x2FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>ACTIVE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRn</name>
          <displayName>IPRn</displayName>
          <description>Interrupt Priority Registers, IPR0
          (0xE000E400) to IPR123 (0xE000E7EC)</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IPR_N0</name>
              <description>IPR_N0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IPR_N1</name>
              <description>IPR_N1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IPR_N2</name>
              <description>IPR_N2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IPR_N3</name>
              <description>IPR_N3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
